// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = 0;
//
// if (x == 0){
//     document.write('Невірно')
//
// }else {
//     document.write('Вірно')
// }
//


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = prompt('Укажи число от 0 до 59!');
//
// if (time <=15){
//     document.write('Первая четверть')
// }else if (time <=30){
//     document.write('Вторая четверть')
// }else if(time <= 45){
//     document.write('Третья четверть')
// }else {
//     document.write('Четвёртая четверть')
// }



// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Укажи дату и узнай декаду)')
//
// if (day <=10){
//     document.write('1 декада')
// } else if(day<=20){
//     document.write('2 декада')
// }else {
//     document.write('3 декада')
// }


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).







//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

let na = prompt('число первое');
let nb = prompt('число второе');

if (na < nb){
    document.write(nb)
} else if (na>nb){
    document.write(na)
} else {
    document.write('Числа равны')
}

