//
// Все стірлочними!!!!!!!!!
// //     - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
//
// let numbers = [1, 3, 5, 6, 9];
//
// let numb = (arr) => {
//     let x = 0;
//     for (const iter of arr) {
//         x = x + iter;
//     }
//     return res = x / arr.length;
//
// }
// console.log(numb(numbers));


// // - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
//
// let numbers = [1, 3, 5, -5, 6, 9];
//
//
// let numberMinMax = (arr) =>{
//     let Min = arr[0];
//     let Max = arr[0];
//
//     for (let number of arr) {
//         if (Min < number){
//             Min = number;
//         }
//         if (Max > number){
//             Max = number;
//         }
//
//
//     }
//     console.log(Max);
//     return Min;
// }
//
// console.log(numberMinMax(numbers));


// // - створити функцію яка заповнює масив рандомними числами
// // (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
//
// function rendomarray(){
//     let numbers = [];
//     for (let i = 0; i < 14; i++) {
//         numbers.push(Math.round(Math.random()*100))
//     }
//     return numbers
// }
//
// console.log(rendomarray());


// // - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// let rendomarray = (limit) =>{
//     let numbers = [];
//     for (let i = 0; i < limit; i++) {
//         numbers.push(Math.round(Math.random()*100))
//     }
//     return numbers
// }
//
// console.log(rendomarray(26));


/*
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
let numbers = [1, 2, 3, 4, 6, 7, 9];


let array = (arr) => {
    let nums = [];
    for (let i = 0; i < arr.length; i++) {
        nums.push(arr[arr.length - 1 - i]);
    }
    return nums
}

console.log(array(numbers));
*/


//
//
//     Переробити на стрілочні функції з попереднього дз
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
//
// -створити функцію, яка приймає масив з 2х об'єктів, та міняє їх місцями.
//
