// 5. Напишіть код,  23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
let a, b, s

a = 23
b = 10
s = a * b
console.log(`${s} см`)

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

let heightC, dC, v, rC, pN

heightC = 10
dC = 4
rC = dC / 2
pN = 3.14
v = pN * Math.pow(rC, 2) + heightC
console.log(v);


// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

let n, m, k

n = 3
m = 4


k = Math.pow(n, 2) + Math.pow(m, 2)
console.log(k);


//
// - Визначити відповідний оператор в виразах що б вийшов відповідний результат.
//     В однакових виразах не використовувати однакові оператори!!!
//     5 ? 6 -> true
// 5 ? 6 -> false
// 5 ? 6 -> false
// 5 ? 6 -> false
// 10 ? 10 -> true
// 10 ? 10 -> true
// 10 ? 10 -> false
// 10 ? 10 -> false
// 10 ? 10 -> false
// 123 ? '123' -> false
// 123 ? '123' -> true

console.log(5 < 6);
console.log(5 >= 6);
console.log(5 > 6);
console.log(5 === 6);
console.log(10 === 10);
console.log(10 >= 10);
console.log(10 > 10);
console.log(10 < 10);
// 10 ? 10 -> false
console.log(123 > '123');
console.log(123 === +'123');